'use strict';//严格模式
const list = [
  "微笑", "撇嘴", "色", "发呆", "得意", "流泪", "害羞", "闭嘴", "睡", "大哭", "尴尬", "发怒", "调皮", "呲牙", "惊讶", "难过", "囧", "抓狂", "吐", "偷笑", "愉快", "白眼", "傲慢", "困", "惊恐", "流汗", "憨笑", "悠闲", "奋斗", "咒骂", "疑问", "嘘", "晕", "衰", "骷髅", "敲打", "再见", "擦汗", "抠鼻", "鼓掌", "坏笑", "左哼哼", "右哼哼", "哈欠", "鄙视", "委屈", "快哭了", "阴险", "亲亲", "可怜", "菜刀", "西瓜", "啤酒", "咖啡", "猪头", "玫瑰", "凋谢", "嘴唇", "爱心", "心碎", "蛋糕", "炸弹", "便便", "月亮", "太阳", "拥抱", "强", "弱", "握手", "胜利", "抱拳", "勾引", "拳头", "OK", "跳跳", "发抖", "怄火", "转圈", "高兴", "口罩", "笑哭", "吐舌头", "傻呆", "恐惧", "悲伤", "不屑", "嘿哈", "捂脸", "奸笑", "机智", "皱眉", "耶", "鬼脸", "合十", "加油", "庆祝", "礼物", "红包", "鸡"
]
let fs = require('fs');//想用API中的哪个模块就用require引进来

let src = '../.././../static/face';//定义一个想修改文件所在的文件夹的路径，相对改js文件

fs.readdir(src, function (err, files) {//读取文件的方法，参数都代表什么，请看文档
  files.forEach(function (filename) {//files是该文件夹下所有文件名的数组集合
    let oldPath = src + '/' + filename
    for (let i = 0; i < list.length; i++) {
      if (filename === (list[i] + '.png')) {
        let newPath = src + '/' + i + '.png';//给图片重新命名
        fs.rename(oldPath, newPath, function (err) {//文件重命名方法，参数代表的意思参考API
          if (!err) {//替换成功，提示信息
            console.log(newPath + '替换成功！');
          }
        })
      }
    }
  })
})